%huawei
p1=[7500 10800 13900 15000 20800 24000 18900 ];
%apple
p2=[14900 23000 21000 21600 21800 19800 20600];
%xiaomi
p2=[6107 6655 5542 9141 11860 12460 14600];

% 初始化参数
r1 = 0.27; 
r2 = 1.00;   
r3 = 0.22; 
N1 = 33493;   
N2 = 23991;  
N3 = 26935;   
s1 = 1.00000000e-05;   
s2 = 1.00000000e-05; 
s3 = 1.00000000e-02;  
s4 = 0.500000000e-0; 
s5 = 1.00000000e-01;   
s6 = 1.00000000e-01;  


% 时间跨度
tspan = [2013, 2020]; % 24个月

% 初始销量
x0 = 7500; % 手机X的初始销量
y0 = 14900; % 手机Y的初始销量
z0 = 6107; % 手机Z的初始销量
initial_conditions = [x0, y0, z0];

% 定义Lotka-Volterra方程
lotka_volterra_compete = @(t, Y) [
    r1*Y(1)*(1 - Y(1)/N1 - s1*Y(2)/N2 - s3*Y(3)/N3);
    r2*Y(2)*(1 - Y(2)/N2 - s2*Y(1)/N1 - s4*Y(3)/N3);
    r3*Y(3)*(1 - Y(3)/N3 - s5*Y(1)/N1 - s6*Y(2)/N2)
];

% 求解微分方程
[t, Y] = ode45(lotka_volterra_compete, tspan, initial_conditions);

% 绘制结果
figure;
plot(t, Y(:,1), 'r', t, Y(:,2), 'b', t, Y(:,3), 'g');
title('三种手机销量预测模型');
xlabel('月份');
ylabel('销量（万台）');
legend({'手机X销量', '手机Y销量', '手机Z销量'}, 'Location', 'northeast');

